In [15]:
import pandas as pd

In [16]:
df=pd.read_csv("heights.csv")

In [17]:
df

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
9     imran    14.5
10     jose     6.1
11  deepika     5.6
12   yoseph     1.2
13    binod     5.5

In [18]:
df.head(9)

     name  height
0   mohan     5.9
1   maria     5.2
2   sakib     5.1
3     tao     5.5
4   virat     4.9
5  khusbu     5.4
6  dmitry     6.2
7  selena     6.5
8    john     7.1

In [19]:
data=df.head(5)

In [20]:
data

    name  height
0  mohan     5.9
1  maria     5.2
2  sakib     5.1
3    tao     5.5
4  virat     4.9

In [21]:
data.sort_values(by='height')

    name  height
4  virat     4.9
2  sakib     5.1
1  maria     5.2
3    tao     5.5
0  mohan     5.9

## detect outlier using percentile

In [22]:
max_thresold=data['height'].quantile(0.5)

In [23]:
max_thresold

5.2

In [24]:
max_thresold=data['height'].quantile(0.95)

In [25]:
max_thresold

5.82

In [26]:
max_thresold=df['height'].quantile(0.95)

In [27]:
max_thresold

9.689999999999998

In [28]:
df[df['height']>max_thresold]

    name  height
9  imran    14.5

In [29]:
min_thresold=df['height'].quantile(.05)

In [30]:
min_thresold

3.6050000000000004

In [31]:
df[df['height']<min_thresold]

      name  height
12  yoseph     1.2

In [32]:
df[df['height']<min_thresold]

      name  height
12  yoseph     1.2

## remove outlier

In [35]:
df[(df['height']<max_thresold) & (df['height']>min_thresold)]

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
10     jose     6.1
11  deepika     5.6
13    binod     5.5

In [36]:
df.describe()

          height
count  14.000000
mean    6.050000
std     2.779804
min     1.200000
25%     5.250000
50%     5.550000
75%     6.175000
max    14.500000